forum/app/controllers/articles_controller.rb

  def index
    total_posts = Article.count                       #コメントの総数
    @total_pages = total_posts / $posts_per_page + 1  #ページの総数
    @are_more_pages = @total_pages > 1                #ページ総数が２ページ以上ならtrue
    page_min_id = total_posts - $posts_per_page + 1   #現ページの投稿の最小id

    #　もし２ページ以上あるなら、最新の$posts_per_page件の投稿のみ取得、
    #　１ページのみ場合は投稿を全て取得
    if @are_more_pages
      @articles = Article.where("id >= ?",  page_min_id).limit($posts_per_page)
    else
      @articles = Article.all
---
SELECT COUNT(*) FROM `articles`
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` IN (NULL, NULL)
SELECT  `articles`.* FROM `articles` LIMIT 10

  def show
    @article = Article.find(params[:id])
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1

  def create
    @article = Article.new(article_params)

    #　エラーがなければデータベースに保存し、
    #　エラーがあった場合は作成画面に戻る
    if @article.save
---
INSERT INTO `articles` (`name`, `email`, `text`, `created_at`, `updated_at`) VALUES ('Tree', '', 'Hey guys!', '2016-03-03 13:00:39', '2016-03-03 13:00:39')

  def delete
    @article = Article.find(params[:id])
    @article.name = "--"
    @article.email = "--"
    @article.text = "--deleted--"
    @article.save
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
UPDATE `articles` SET `name` = '--', `email` = '--', `text` = '--deleted--', `updated_at` = '2016-03-04 06:45:58' WHERE `articles`.`id` = 1

  def page
    total_posts = Article.count                       #コメントの総数
    @total_pages = total_posts / $posts_per_page + 1  #ページの総数
    @current_page = params[:number].to_i              #現在のページ（トップページ＝１、次のページ＝２、・・・）
    @are_more_pages = @total_pages > @current_page    #次ページが存在するならtrue
    page_min_id = total_posts - $posts_per_page * @current_page + 1  #現ページの投稿の最小id

    # urlを http://~~~/articles/page/-1 などとした場合にはトップページに飛ばす
    if @current_page <= 1
      redirect_to articles_path
    end

    #　次のページが存在する場合、現ページの$posts_per_page件の投稿を取得し、
    #　現ページが最後のページならば、残った端数の投稿を抽出して取得
    if @are_more_pages
      @articles = Article.where("id >= ?", page_min_id).limit($posts_per_page)
    else
      @articles = Article.limit(total_posts % $posts_per_page)
---
SELECT COUNT(*) FROM `articles`
SELECT  `articles`.* FROM `articles` WHERE (id >= 16) LIMIT 10
SELECT  `articles`.* FROM `articles` LIMIT 5

  def all
    @articles = Article.all
---
SELECT `articles`.* FROM `articles`

  def admin
    @articles = Article.all
---
SELECT `articles`.* FROM `articles`